mengwong/workplan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-21 Thu 16:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Wong Meng Weng" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3f40d33">1. People Assignments</a>
<ul>
<li><a href="#org581493a">1.1. Available People</a></li>
<li><a href="#orgf0acbdf">1.2. Specialization Domains</a></li>
<li><a href="#org3b39b9d">1.3. People and Projects</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3f40d33" class="outline-2">
<h2 id="org3f40d33"><span class="section-number-2">1.</span> People Assignments</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org581493a" class="outline-3">
<h3 id="org581493a"><span class="section-number-3">1.1.</span> Available People</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Jo Hsi</li>
<li>Joe</li>
<li>Avishkar</li>
<li>Ruslan</li>
<li>Maryam</li>
<li>Max Loo</li>
<li>Meng</li>
<li>Martin</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0acbdf" class="outline-3">
<h3 id="orgf0acbdf"><span class="section-number-3">1.2.</span> Specialization Domains</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>sta = statics</dt><dd>constitutive rules, AnyAll, and/or tree</dd>
<dt>dyn = dynamic</dt><dd>regulative / prescriptive rules, moving parts, state diagrams, petri net, DFA</dd>
<dt>ont = ontology</dt><dd>class relationships, type system, database schema.</dd>
<dt>ter = terms</dt><dd>variable/value-level details like "this is a contract between Mark and Oliver"; also traces of event logs</dd>
<dt>def = defeasibility</dt><dd>meta rules, rules that override over rules. Scopes?</dd>
<dt>nlg = natural language generation</dt><dd>serialization to natural language</dd>
</dl>
</div>
</div>

<div id="outline-container-org3b39b9d" class="outline-3">
<h3 id="org3b39b9d"><span class="section-number-3">1.3.</span> People and Projects</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">Domains</th>
<th scope="col" class="org-left">Project</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Meng</td>
<td class="org-left">sta</td>
<td class="org-left">Vue web app (old)</td>
<td class="org-left">make the and/or tree interactive so users can do deductive reasoning to reach an answer; v8k runs the app</td>
</tr>

<tr>
<td class="org-left">Max</td>
<td class="org-left">sta</td>
<td class="org-left">Vue web app (new)</td>
<td class="org-left">support multiple heads in a single page; switch to the latest SVG diagramming instead of the d3.</td>
</tr>

<tr>
<td class="org-left">Meng</td>
<td class="org-left">ter</td>
<td class="org-left">JSON</td>
<td class="org-left">output the symbol table to JSON.</td>
</tr>

<tr>
<td class="org-left">Meng</td>
<td class="org-left">ont</td>
<td class="org-left">TypeScript</td>
<td class="org-left">output the class declarations to TS class declarations</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ter</td>
<td class="org-left">Scenario Testing</td>
<td class="org-left">make the GIVEN / EXPECT rules actually evaluate as part of a "natural4-exe &#x2013;test"</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Avishkar</td>
<td class="org-left">all</td>
<td class="org-left">CoreL4</td>
<td class="org-left">transpiler to Baby L4 that retains all the expressiveness</td>
</tr>

<tr>
<td class="org-left">Avishkar</td>
<td class="org-left">sta</td>
<td class="org-left">Prolog</td>
<td class="org-left">improve L4 Prolog Transpiler or go via BabyL4; output all BoolStruct elements.</td>
</tr>

<tr>
<td class="org-left">Avishkar</td>
<td class="org-left">sta</td>
<td class="org-left">Epilog</td>
<td class="org-left">output to Epilog syntax, through to creation of an epilog web app similar to our vue app</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sta + dyn</td>
<td class="org-left">Logical English</td>
<td class="org-left">output to Logical English syntax, through to creation of a web app in SWISH similar to our vue app</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://www.youtube.com/watch?v=9I3xshz4T0E">https://www.youtube.com/watch?v=9I3xshz4T0E</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">book: Commonsense Reasoning</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ruslan</td>
<td class="org-left">sta</td>
<td class="org-left">statics SVG viz</td>
<td class="org-left">visualize all BoolStruct statics. Get SMALL Mode working. Support mouseover tooltips to next size up</td>
</tr>

<tr>
<td class="org-left">Jo Hsi</td>
<td class="org-left">sta</td>
<td class="org-left">DMN decision diagram</td>
<td class="org-left">output all BoolStruct elements as DMN tables or FEEL expressions. Connect them up using DRD.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sta + ont</td>
<td class="org-left">Catala</td>
<td class="org-left">output DECIDE rules and BoolStruct elements to Catala.</td>
</tr>

<tr>
<td class="org-left">Joe</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deon's CSL</td>
<td class="org-left">learn about CSL and steal ideas from them, no need to output to their language just yet.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sta + ont</td>
<td class="org-left">DocAssemble</td>
<td class="org-left">create a full DocAssemble web app similar to our vue app</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sta + ont</td>
<td class="org-left">CheckFirst</td>
<td class="org-left">create a full CheckFirst web app similar to our vue app</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">feels like basically a DMN front-end invented by people who didn't know about DMN</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sta + ont + def</td>
<td class="org-left">Blawx</td>
<td class="org-left">create a full Blawx app similar to our vue app</td>
</tr>

<tr>
<td class="org-left">Ruslan</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Morphir</td>
<td class="org-left">investigate Morphir and export the "business logic" components of an L4 program to it</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Maryam</td>
<td class="org-left">nlg + all</td>
<td class="org-left">Word doc</td>
<td class="org-left">via intermediate output e.g. Markdown, then converted using Pandoc</td>
</tr>

<tr>
<td class="org-left">Maryam</td>
<td class="org-left">nlg + ter</td>
<td class="org-left">PDF</td>
<td class="org-left">via intermediate output e.g. Markdown, then converted using Pandoc; embed the L4 symbol table using l4meta.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ter + all</td>
<td class="org-left">PDF</td>
<td class="org-left">In future, embed all the L4 source in the PDF using l4meta. Discuss with Meng about doing the SAFE.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">nlg + all</td>
<td class="org-left">Akoma Ntoso</td>
<td class="org-left">Direct to XML using hxt?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Joe</td>
<td class="org-left">dyn</td>
<td class="org-left">Petri Net viz</td>
<td class="org-left">currently under renovation</td>
</tr>

<tr>
<td class="org-left">Joe</td>
<td class="org-left">dyn</td>
<td class="org-left">Tapaal</td>
<td class="org-left">output our Petri nets to Tapaal format, so we can run an engine "headlessly" for verification</td>
</tr>

<tr>
<td class="org-left">Max</td>
<td class="org-left">dyn</td>
<td class="org-left">BPMN workflow</td>
<td class="org-left">BPMN is basically a timed Petri Net invented by people who didn't know about timed Petri Nets</td>
</tr>
</tbody>
</table>

<p>
Another project &#x2013; formalization of the SAFE, and using that as a demonstration use case: creation of a SAFE Word doc, creation of PDF, embedding of JSON and L4 rules into the PDF.
</p>

<p>
Thorne on LLD: <a href="https://www.youtube.com/watch?v=0YeesAW7-Rc">https://www.youtube.com/watch?v=0YeesAW7-Rc</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wong Meng Weng</p>
<p class="date">Created: 2022-07-21 Thu 16:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
